src/toir_cf/src/Catalogs/торо_ПоказателиKPI/торо_ПоказателиKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПоказателиKPI</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.торо_ТипыПоказателейKPI</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполнения</name>
    <type>
      <types>EnumRef.торо_ВариантыЗаполненияПоказателяKPI</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФормулы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВнешнегоПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПоставляемойМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделительКакЕдиницаИзмерения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевойТренд</name>
    <type>
      <types>EnumRef.торо_ВидыЦелевыхТрендовПоказателейKPI</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/toir_cf/src/Enums/торо_ВариантыЗаполненияПоказателяKPI/торо_ВариантыЗаполненияПоказателяKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыЗаполненияПоказателяKPI</name>
  <enumValues>
    <name>Формула</name>
  </enumValues>
  <enumValues>
    <name>СКД</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийПоказатель</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/торо_ПоказателиKPI/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ВариантЗаполнения = Перечисления.торо_ВариантыЗаполненияПоказателяKPI.Формула Тогда
			ПроверяемыеРеквизиты.Добавить("ТекстФормулы");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторДляФормул) Тогда
			ЗапрещенныеСимволы = торо_ПоказателиKPIКлиентСервер.ПолучитьЗапрещенныеСимволыДляФормул();
			
			Для каждого ЗапрещенныйСимвол из ЗапрещенныеСимволы Цикл
				Если СтрНайти(ИдентификаторДляФормул, ЗапрещенныйСимвол) > 0 Тогда
					ТекстСообщения = НСтр("ru='Представление для формул не может содержать пробелы и специальные символы, кроме подчеркивания.'");
					#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ИдентификаторДляФормул",, Отказ);
					#Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ИдентификаторДляФормул",, Отказ);
					#КонецЕсли
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если РазделительКакЕдиницаИзмерения Тогда
			ПроверяемыеРеквизиты.Добавить("Разделитель");
		Иначе
			ПроверяемыеРеквизиты.Добавить("ЕдиницаИзмерения");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДПоставляемойМодели = "";
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

#КонецЕсли

#КонецОбласти
